#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: @mu-ruU1, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu-archive: Reading...
data.sakuracloud_archive.ubuntu-archive: Read complete after 1s [id=113402076881]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # sakuracloud_disk.k8s-lb-disk[0] will be created
  + resource "sakuracloud_disk" "k8s-lb-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-lb-1-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-lb-disk[1] will be created
  + resource "sakuracloud_disk" "k8s-lb-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-lb-2-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-master-disk[0] will be created
  + resource "sakuracloud_disk" "k8s-master-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-master-1-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-master-disk[1] will be created
  + resource "sakuracloud_disk" "k8s-master-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-master-2-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-master-disk[2] will be created
  + resource "sakuracloud_disk" "k8s-master-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-master-3-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-node-disk[0] will be created
  + resource "sakuracloud_disk" "k8s-node-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-node-1-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-node-disk[1] will be created
  + resource "sakuracloud_disk" "k8s-node-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-node-2-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-node-disk[2] will be created
  + resource "sakuracloud_disk" "k8s-node-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-node-3-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 40
      + source_archive_id = "113402076881"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-rook-disk[0] will be created
  + resource "sakuracloud_disk" "k8s-rook-disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "k8s-rook-1-dev"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 40
      + tags      = [
          + "dev",
          + "k8s",
        ]
      + zone      = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-rook-disk[1] will be created
  + resource "sakuracloud_disk" "k8s-rook-disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "k8s-rook-2-dev"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 40
      + tags      = [
          + "dev",
          + "k8s",
        ]
      + zone      = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-rook-disk[2] will be created
  + resource "sakuracloud_disk" "k8s-rook-disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "k8s-rook-3-dev"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 40
      + tags      = [
          + "dev",
          + "k8s",
        ]
      + zone      = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s-router-disk[0] will be created
  + resource "sakuracloud_disk" "k8s-router-disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "k8s-router-1-dev"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = "113500057368"
      + tags              = [
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)
    }

  # sakuracloud_internet.k8s-external-switch will be created
  + resource "sakuracloud_internet" "k8s-external-switch" {
      + band_width           = 100
      + gateway              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = "k8s-external-switch"
      + netmask              = 28
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-lb-server[0] will be created
  + resource "sakuracloud_server" "k8s-lb-server" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "k8s-lb-1-server-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-lb-1-server-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.30"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-lb-server[1] will be created
  + resource "sakuracloud_server" "k8s-lb-server" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "k8s-lb-2-server-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-lb-2-server-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.31"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-master-server[0] will be created
  + resource "sakuracloud_server" "k8s-master-server" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s-master-1-server-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-master-1-server-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.10"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-master-server[1] will be created
  + resource "sakuracloud_server" "k8s-master-server" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s-master-2-server-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-master-2-server-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.11"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-master-server[2] will be created
  + resource "sakuracloud_server" "k8s-master-server" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s-master-3-server-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-master-3-server-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.12"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-node-server[0] will be created
  + resource "sakuracloud_server" "k8s-node-server" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s-node-1-server-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-node-1-server-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.20"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-node-server[1] will be created
  + resource "sakuracloud_server" "k8s-node-server" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s-node-2-server-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-node-2-server-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.21"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-node-server[2] will be created
  + resource "sakuracloud_server" "k8s-node-server" {
      + commitment        = "standard"
      + core              = 4
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "k8s-node-3-server-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "k8s-node-3-server-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_key_ids     = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.22"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s-router[0] will be created
  + resource "sakuracloud_server" "k8s-router" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "k8s-router-1-dev"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = false
          + gateway         = (known after apply)
          + hostname        = "k8s-router-1-dev"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_ssh_key_gen.gen_key will be created
  + resource "sakuracloud_ssh_key_gen" "gen_key" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "k8s_pub_key"
      + private_key = (known after apply)
      + public_key  = (known after apply)
    }

  # sakuracloud_subnet.bgp-subnet will be created
  + resource "sakuracloud_subnet" "bgp-subnet" {
      + id              = (known after apply)
      + internet_id     = (known after apply)
      + ip_addresses    = (known after apply)
      + max_ip_address  = (known after apply)
      + min_ip_address  = (known after apply)
      + netmask         = 28
      + network_address = (known after apply)
      + next_hop        = (known after apply)
      + switch_id       = (known after apply)
      + zone            = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_switch.k8s-internal-switch will be created
  + resource "sakuracloud_switch" "k8s-internal-switch" {
      + id         = (known after apply)
      + name       = "k8s-internal-switch"
      + server_ids = (known after apply)
      + zone       = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + external_address_range       = (known after apply)
  + k8s_lb_server_ip_address     = [
      + (known after apply),
      + (known after apply),
    ]
  + k8s_master_server_ip_address = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + k8s_node_server_ip_address   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + k8s_router_ip_address        = [
      + (known after apply),
    ]
  + vip_address                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>